In [23]:
#A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units.
#A randomly selected sample of cutlets was collected from both units and measured? 
#Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you 
#carried out to check validity of the assumptions.
#SOLUTION
#1. TO PERFORM HYPOTHESIS TESTING WE DEFINE NULL HYPOTHESIS AND ALTERNATE HYPOTHESIS
    # H0 if two mu are same
    # HA two mu are different
#2. ALPHA = 5% =0.05
# AS WE NEED TO FIND THE DIFFERENCE SO WE WILL GO FOR TWO TAILED TEST (DATA IS NUMERICAL VALUE)
# cALCULATE tEST STATISTICS
# two tailed test 
# alpha = 0.025
#

In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import warnings
warnings.filterwarnings('ignore')
import scipy
import pylab as p 
import seaborn as sns
from scipy.stats import skew
import plotly.express as px
from scipy import stats
from scipy.stats import norm

In [2]:
data = pd.read_csv('Cutlets.csv')

In [3]:
data

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [5]:
data.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [6]:
data.mean()

Unit A    7.019091
Unit B    6.964297
dtype: float64

In [8]:
data.isnull().sum()

Unit A    0
Unit B    0
dtype: int64

In [13]:
data[data.duplicated()]

Empty DataFrame
Columns: [Unit A, Unit B]
Index: []

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Unit A  35 non-null     float64
 1   Unit B  35 non-null     float64
dtypes: float64(2)
memory usage: 688.0 bytes

In [18]:
alpha = 0.05
t_statistic , p_value = stats.ttest_ind(data['Unit A'],data['Unit B'], alternative = 'two-sided')
p_value
if p_value > alpha:
    print('Accept NULL HYPOTHESIS')
else:
    print('Reject NULL HYPOTHESIS')

Accept NULL HYPOTHESIS

In [ ]:
# Q2 A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the
#laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories.
#TAT is defined as sample collected to report dispatch.   
#Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% 
#significance level.
#H0 = ALL MU ARE SAME
#HA SOME MU VALUES ARE NOT SAME

In [19]:
data2=pd.read_csv('LabTAT.csv')
data2.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [20]:
data2.mean()

Laboratory 1    178.361583
Laboratory 2    178.902917
Laboratory 3    199.913250
Laboratory 4    163.682750
dtype: float64

In [21]:
data2.isnull().sum()

Laboratory 1    0
Laboratory 2    0
Laboratory 3    0
Laboratory 4    0
dtype: int64

In [22]:
data2[data2.duplicated()]

Empty DataFrame
Columns: [Laboratory 1, Laboratory 2, Laboratory 3, Laboratory 4]
Index: []

In [28]:
alpha =0.05
test_statistic2 , p_value2 = stats.f_oneway(data2.iloc[:,0],data2.iloc[:,1],data2.iloc[:,2],data2.iloc[:,3])

if(alpha< p_value2):
    print('Accept NULL HYPOTHESIS')
else:
    print('Reject NULL HYPOTHESIS')

Reject NULL HYPOTHESIS

In [27]:
print(p_value2)

2.1156708949992414e-57

In [41]:
#Q3 Sales of products in four different regions is tabulated for males and females. 
#Find if male-female buyer rations are similar across regions.
#H0 =All proportions are equal
#HA = Not all Proportions are equal

In [30]:
data3 = pd.read_csv('BuyerRatio.csv')

In [31]:
data3.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [33]:
data3.isnull().sum()

Observed Values    0
East               0
West               0
North              0
South              0
dtype: int64

In [34]:
data3[data3.duplicated()]

Empty DataFrame
Columns: [Observed Values, East, West, North, South]
Index: []

In [35]:
data3.describe() #All mu are not same

             East         West        North       South
count    2.000000     2.000000     2.000000    2.000000
mean   242.500000   832.500000   743.500000  410.000000
std    272.236111   976.514465   866.205807  480.832611
min     50.000000   142.000000   131.000000   70.000000
25%    146.250000   487.250000   437.250000  240.000000
50%    242.500000   832.500000   743.500000  410.000000
75%    338.750000  1177.750000  1049.750000  580.000000
max    435.000000  1523.000000  1356.000000  750.000000

In [47]:
from scipy.stats import chi2_contingency 
table = [[50,142,131,70],
        [435,1523,1356,750]]
print(table)
stat, p_value3, dof,exp= chi2_contingency(table) 
print('degree of freedom',dof,'\n')
significance_level = 0.05
print("p value: " + str(p_value3),'\n') 
if p_value3 <= significance_level: 
    print('Reject NULL HYPOTHESIS') 
else: 
    print('ACCEPT NULL HYPOTHESIS')

[[50, 142, 131, 70], [435, 1523, 1356, 750]]
degree of freedom 3

p value: 0.6603094907091882

ACCEPT NULL HYPOTHESIS

In [48]:
#Q4 TeleCall uses 4 centers around the globe to process customer order forms. 
#They audit a certain %  of the customer order forms. Any error in order form renders 
#it defective and has to be reworked before processing.  The manager wants to check whether the defective %  
#varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences

In [49]:
data4 = pd.read_csv('Costomer+OrderForm.csv')
data4.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [50]:
data4.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [52]:
data4.isnull().sum()

Phillippines    0
Indonesia       0
Malta           0
India           0
dtype: int64

In [55]:
data4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Phillippines  300 non-null    object
 1   Indonesia     300 non-null    object
 2   Malta         300 non-null    object
 3   India         300 non-null    object
dtypes: object(4)
memory usage: 9.5+ KB

In [56]:
print(data4['Phillippines'].value_counts(),'\n')
print(data4['Indonesia'].value_counts(),'\n')
print(data4['Malta'].value_counts(),'\n')
print(data4['India'].value_counts())

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

Error Free    269
Defective      31
Name: Malta, dtype: int64

Error Free    280
Defective      20
Name: India, dtype: int64

In [57]:
table4 = [[271,267,269,280],[29,33,31,20]]

In [58]:
stat, p_value4, df_4, exp_4 = stats.chi2_contingency(table4)
print("Statistics = ",stat,"\n",'P_Value = ', p_value4,'\n', 'degree of freedom =', df_4,'\n', 'Expected Values = ', exp)

Statistics =  3.858960685820355
 P_Value =  0.2771020991233135
 degree of freedom = 3
 Expected Values =  [[  42.76531299  146.81287862  131.11756787   72.30424052]
 [ 442.23468701 1518.18712138 1355.88243213  747.69575948]]

In [59]:
significance_level4 =0.05
if p_value4 <= significance_level4: 
    print('Reject NULL HYPOTHESIS') 
else: 
    print('ACCEPT NULL HYPOTHESIS')

ACCEPT NULL HYPOTHESIS